[
  {
    "title": "Let's Build a Portfolio: Gatsby + Netlify + NetlifyCMS",
    "description": "Workshop that guides attendees through creating a portfolio site using JAMstack technologies such as Gatsby as a Static Site Generator, Netlify for deployment, and NetlifyCMS as a headless CMS to manage and create new content.",
    "slidesURL": "",
    "originalDate": "08/31/2020",
    "featured": "false",
    "tags": [
      "WWCode",
      "JAMstack",
      "Gatsby",
      "Netlify",
      "NetlifyCMS",
      "Portfolio"
    ]
  },
  {
    "title": "Explore the JAMstack",
    "description": "This presentation introduces attendees to the main ideas and concepts that make up the JAMstack.",
    "slidesURL": "",
    "originalDate": "07/27/2020",
    "featured": "false",
    "tags": ["WWCode", "JAMstack"]
  },
  {
    "title": "Portfolios?",
    "description": "Answer some basic questions about Portfolio websites. Who needs one? What is a portfolio site? What should you include? When should you start building a portfolio? Where can I get ideas and inspiration? Why should you maintain your site when you aren't actively job hunting? Why should you even have a portfolio site?",
    "slidesURL": "",
    "originalDate": "04/27/2020",
    "featured": "false",
    "tags": ["WWCode", "Portfolio"]
  },
  {
    "title": "A Crash Course in CSS Animation",
    "description": "This short talk introduces attendees to the basics of creating movement and animation with just CSS. Includes examples and demos to get them excited to try it out on there own and start exploring what animation can add to their own projects.",
    "slidesURL": "",
    "originalDate": "04/13/2020",
    "featured": "false",
    "tags": ["CSS", "Animation"]
  },
  {
    "title": "Animating Your Portfolio to Awesome with Greensock",
    "description": "This talk introduces attendees to the Greensock Animation Platform (GSAP) and shows them how to get started. We also review some when's and why's for using animations and share fun demos to get them excited to try it on their own.",
    "slidesURL": "",
    "originalDate": "07/09/2019",
    "featured": "true",
    "tags": ["Greensock", "JavaScript", "Animation", "Portfolio"]
  },
  {
    "title": "Level Up Your CSS Debugging",
    "description": "This lightning/short talk demonstrates some of the functions and power of DevTools available in the Firefox browser specific to working with CSS and styling a page.",
    "slidesURL": "",
    "originalDate": "06/25/2019",
    "featured": "true",
    "tags": ["CSS", "DevTools", "Firefox"]
  },
  {
    "title": "Dig In On Grid",
    "description": "This conference talk gives a brief history of styling on the web followed by an introduction to how (and when) to use some of the new layout tools such as flexbox and grid. While the talk focuses on the technicals of using CSS Grid, it also reviews flexbox so attendees understand when to use each of these awesome layout tools.",
    "slidesURL": "",
    "originalDate": "11/02/2018",
    "featured": "true",
    "tags": ["CSS", "CSS Grid", "Flexbox", "Layouts"]
  },
  {
    "title": "I Get By With A Little Help From My Community",
    "description": "This talk focuses on my own journey into the tech community and my growth into a social person. It provides stories to try to encourage others to get more social.",
    "slidesURL": "",
    "originalDate": "09/19/2018",
    "featured": "false",
    "tags": ["Community", "My Story"]
  },
  {
    "title": "Overcoming Fear of the Command Line with Rainbows and Dragons",
    "description": "My first ever talk! This quick lightning talk was written at Write Speak Code in August of 2017. This talk addresses the intense fear and struggles I suffered when I first started learning how to use the command line as a developer and some fun tips and tricks to make it less scary.",
    "slidesURL": "",
    "originalDate": "11/11/2017",
    "featured": "false",
    "tags": ["Command Line", "Lightning Talk"]
  }
]
